[IsmsRogue X2SoldierClassTemplate]
+DisplayName="Rogue"
+ClassSummary="The Rogue utilizes superior mobility, damage, and evasion to create flanking and scouting opportunites. The Rogue gains bonuses while outmaneuvering opponents."
+LeftAbilityTreeTitle="Ghost"
+RightAbilityTreeTitle="Lone Wolf"
AbilityTreeTitles[0]="Ghost"
AbilityTreeTitles[1]="Lone Wolf"
AbilityTreeTitles[2]="Scout"
AbilityTreeTitles[3]="XCom"

+RandomNickNames[0]="Slick"
+RandomNickNames[1]="Ghost"
+RandomNickNames[2]="Banshee"
+RandomNickNames[3]="Spectre"
+RandomNickNames[4]="Roach"
+RandomNickNames[5]="Ism"
+RandomNickNames[6]="Exsel"
+RandomNickNames[7]="Shadow"
+RandomNickNames[8]="Shade"
+RandomNickNames[9]="Slip"
+RandomNickNames[10]="Ice"

[IsmsRogueGTSUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Rogue: Infiltrator"
Summary="All Rogues gain Lightning Reflexes and +40 hacking."


